{
    "version": "https://jsonfeed.org/version/1",
    "title": "NOTELISM",
    "description": "",
    "home_page_url": "https://notelism.com",
    "feed_url": "https://notelism.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "one"
    },
    "items": [
        {
            "id": "https://notelism.com/five-effective-ways-to-cultivate-good-reading-habits/",
            "url": "https://notelism.com/five-effective-ways-to-cultivate-good-reading-habits/",
            "title": "Five effective ways to cultivate good Reading habits",
            "summary": " Taking reading as a hobby is a thing that does not have a high threshold, but it can make people enjoy it and benefit a lot from it. But the fun and benefits of reading are relatively advanced, it is difficult to directly or&hellip;",
            "content_html": "\n  <p>\n    Taking reading as a hobby is a thing that does not have a high threshold, but it can make people enjoy it and benefit a lot from it.\nBut the fun and benefits of reading are relatively advanced, it is difficult to directly or easily show in front of us, but requires a process of reading accumulation and precipitation.Therefore, to develop good reading habits and persist in reading is a thing worth our time and energy to cultivate and do.\n  </p>\n\n    <h2 id=\"1-make-a-list-and-make-a-plan\">\n      1. Make a list and make a plan.\n    </h2>\n\n  <p>\n    <strong>Step 1</strong>: think about which books you are interested in, which books (knowledge) you urgently need, and which are good for you.\nIf you can't find a book, the easiest way is to find someone to recommend it or search the Internet based on keywords.\n<br><strong>Step 2</strong>: make a list of books for yourself according to the first step, usually in years or months.\n<br><strong>Step 3</strong>: incorporate the book list into your reading plan, that is, what books you want to read each month, how much time you spend reading or how much you read each day.\nMake a table and post it in a conspicuous place (you can use a colored pen to make this reading schedule creatively).\n<br><strong>Step 4</strong>: put the books you want to read that day in the ready, on the desk and other places.\n<br>This will serve as a reminder to prevent you from forgetting or procrastinating again and again.\n  </p>\n\n    <h2 id=\"2-from-shallow-to-deep-from-simple-to-complex\">\n      2. From shallow to deep, from simple to complex\n    </h2>\n\n  <p>\n    Many of us always overestimate our abilities, which is reflected in the fact that we have bought a lot of books, but very few of us have actually finished or read them.\nOne of the big reasons is that the selected books are higher than their own reading level, it is difficult to read, and slowly they lose interest.\n  </p>\n\n  <p>\n    In the matter of reading, don't aim too high at the beginning and choose books that are very heavy and difficult to understand, resulting in less and less interest in reading.\nYou should first choose books that are easy to read and easy to understand, and then wait until you have some foundation, and then step by step to read books that are more difficult on the same subject.\nIn fact, in every topic, there will be relatively simple and advanced books. Before you have a foundation, start with simple or interesting books.\n  </p>\n\n    <h2 id=\"3-improve-reading-skills\">\n      3. Improve reading skills.\n    </h2>\n\n  <p>\n    If you want to develop good reading habits and enjoy the benefits and fun of reading, it is necessary to learn and master some reading skills.\nThere are a lot of detailed reading skills, many of which have been taught by teachers at school, so here are just a few:\n  </p>\n\n  <p>\n    1) when reading, focus on the main contents and related arguments of each paragraph.\nWhen reading, use a pencil to draw notes and mark the key points of each paragraph, which also helps to improve your reading ability.\n  </p>\n\n  <p>\n    2) when you encounter words and opinions that you don't understand in reading, don't look it up in the dictionary or look up the materials. You can contact the sentence before and after, or try to understand it in context, which is helpful to improve your reading and thinking ability.\n  </p>\n\n  <p>\n    3) Train your ability of fast reading.This does not mean that you should have a reading speed of tens of thousands of words per minute. The key is to change your traditional word-by-word reading habits and improve your reading efficiency.\nBecause reading slowly word by word, not only the reading speed is slow, but also its comprehension rate is not high.\n  </p>\n\n  <p>\n    The focus of the training of fast reading method is to activate our \"brain and eye\" potential, and to cultivate a reading learning style of eye-brain direct reflection.\nNot to mention those great gods who count at a glance, as long as we ordinary people train consciously and read 5-10 words at a glance, everyone can easily master it.\n  </p>\n\n  <p>\n    4) To understand a book from multiple angles.\nEveryone will be limited by their own knowledge structure, ability and other factors, when reading, they can only read and understand a book from the level closest to them.\nFor good books, there are generally a lot of comments and understanding of big V or celebrities online, or articles, books, or videos, explanations, might as well listen to their views.\n  </p>\n\n    <h2 id=\"4-reading-and-writing-are-not-separated-writing-strengthens-reading-and-promotes-reading\">\n      4. Reading and writing are not separated. Writing strengthens reading and promotes reading.\n    </h2>\n\n  <p>\n    <strong>Consolidate reading</strong>: after reading a book, or just a part of it, and then write about your understanding and perception after reading, even if it is just a simple reading style writing, you can further understand and master what you are reading.\n  </p>\n\n  <p>\n    <strong>Promote reading</strong>: when you need or want to write an article on a topic, in order to write better, you will flip through some books and materials related to the topic, which virtually urges you to read. and eventually form a virtuous circle.\nOn the other hand, sharing what you write will encourage you to continue reading and writing.\n  </p>\n\n    <h2 id=\"5-integrate-reading-into-daily-life\">\n      5. Integrate reading into daily life\n    </h2>\n\n  <p>\n    First of all, provide yourself with a suitable place to read.\nIf you live around a library and other places suitable for reading, it is best to feel more.\nIf not, it doesn't matter. Discover or create a place for reading on your own.\n  </p>\n\n  <p>\n    Second, Make good use of your mobile phone, read e-books through your mobile phone, and excellent articles, all of which will increase your reading ability.\n  </p>\n\n  <p>\n    In addition, you can also organize your own family and friends to participate in reading and share the fun and harvest of reading.\n  </p>",
            "author": {
                "name": "one"
            },
            "tags": [
                   "Study",
                   "Reading"
            ],
            "date_published": "2021-04-30T22:34:02+08:00",
            "date_modified": "2021-04-30T22:34:02+08:00"
        },
        {
            "id": "https://notelism.com/using-the-pyramid-principle-to-write-a-good-article/",
            "url": "https://notelism.com/using-the-pyramid-principle-to-write-a-good-article/",
            "title": "Using the pyramid principle to write a good article",
            "summary": " A good article is an article with a clear structure. Usually we talk about the current account, in fact, it is a simple record of our thinking process, if we just show ourselves, such an article is not a big problem, we can fully&hellip;",
            "content_html": "\n    <h2 id=\"a-good-article-is-an-article-with-a-clear-structure\">\n      A good article is an article with a clear structure.\n    </h2>\n\n  <p>\n    Usually we talk about the current account, in fact, it is a simple record of our thinking process, if we just show ourselves, such an article is not a big problem, we can fully understand our own way of thinking. But if you want to show it to others, simply explaining the process can be confusing to the reader. Because everyone has different knowledge reserves and different ways of thinking, forcing readers to understand the article according to our way of thinking makes it feel like \"Hello, I am your father\".<br>The clear structure of the article is that the author collates his own ideas and presents them in a way that readers can understand. At the top of the pyramid is the central idea behind the  article. Ideally the content of the lower layer is carried out layer by layer, and the content of the lower layer is a detailed discussion of the content of the upper layer, and the content of the upper layer is a summary of the content of the lower layer. This structure is in line with the basic principles of human cognition, making it is easier for readers to understand the structure of the human brain.\n  </p>\n\n    <h2 id=\"pyramids-are-a-way-to-organize-content\">\n      Pyramids are a way to organize content\n    </h2>\n\n  <p>\n    There are horizontal and vertical relations throughout the pyramid structure. At the top of the pyramid is the core idea of the whole article. And then on the next level, the pyramid is simply a way to organize content from top to bottom.<br>There are horizontal and vertical relations throughout the pyramid structure.<br>In the vertical relationship, the upper thought is the summary of the lower layer, while the lower thought is the explanation of the upper layer, and the top layer is the theme of the whole article, followed by the explanation of the theme, and then the further explanation of the details.<br>In the horizontal relationship, each thought is an explanation to the upper level, and the content also belongs to the same category. For example, in this article, the  core idea is \"how to use the pyramid principle to write a good article\", and then on the second layer, which you see now, is to discuss the core idea of the pyramid principle and how to use it to write a good article. Several key points discussed include \"what is a good article\", \"what is the pyramid principle\", \"why to use the pyramid principle\" and \"how to use the pyramid principle\".\n  </p>\n\n    <h2 id=\"pyramid-structure-makes-the-article-easier-to-understandbr\">\n      Pyramid structure makes the article easier to understand<br>\n    </h2>\n\n  <p>\n    There are two ways in which we first perceive things, one is from the top down, and the other is from the bottom up.Usually we first use a top-down approach to identify things.Suppose you are in the computer city and see something beautiful thing in the showcase of a store that you have never seen before.You know you are in the computer city, so you can see that the business scope of this store is digital products, so you can conclude that this thing is a digital product.You'll be attracted to it, want to learn more, and eventually realize that this is a new router.\n  </p>\n\n  <p>\n    This is the basic process of human recognition of things, and we will first try to understand things macroscopically, and then explore these things in detail.The pyramid principle is such a top-down structure that readers are the first to come into contact with the topic of the article in the process of reading, which limits the scope of the article, helps readers determine the direction of thinking, and  readers  the content of the article. in order to better understand the article more quickly and accurately.\n  </p>\n\n    <h2 id=\"build-a-pyramid-structure-before-writing\">\n      Build a pyramid structure before writing\n    </h2>\n\n  <p>\n    Before you actually write an article, you need to sort out the pyramid structure of the article, usually using a top-down approach to building the pyramid structure:\n  </p>\n\n  <ol>\n    <li>Write out the theme of the article.</li><li>Raise questions in the reader's mind.</li><li>If you have an answer, answer the question.</li><li>Write out the background.</li><li>Point out the conflict.</li><li>Check whether the question is valid to prevent the topic from deviating.</li><li>Readers will ask new questions about the answer.</li><li>Determine whether to use deduction or induction to answer new questions.</li><li>Repeat steps 7 and 8.</li>\n  </ol>\n\n    <h5 id=\"what-are-deduction-and-induction\">\n      What are deduction and induction?\n    </h5>\n\n  <p>\n    The deductive method is in the same layer of the pyramid, which is discussed horizontally according to the logical order or chronological order, and finally uses \"therefore\" to get the result.\nThe upper layer of deductive reasoning is a summary of the deductive process, with emphasis on the conclusion after \"therefore\".\n  </p>\n\n  <p>\n    Induction is a horizontal summary of the common characteristics of each thought, from which to draw a conclusion. There is a certain jump between the conclusion and each thought, so the inductive method is more difficult to use than the deductive method, it needs to be analyzed in combination with a variety of situations, and the author's position and collected information will have an impact on the final conclusion.\n  </p>\n\n  <p>\n    <strong>Generally speaking, in the higher level of the article, the inductive method is used, while in the lower level, the deductive method is used.</strong>\n  </p>\n\n    <h2 id=\"present-the-pyramid-structure-in-the-article\">\n      Present the pyramid structure in the article\n    </h2>\n\n  <p>\n    Structure is the skeleton of the article, which plays a good guiding role in the subsequent writing process.The whole writing process is equivalent to supplementing the pyramid structure by making it fuller.The beginning of the article is at the top of the pyramid.\n  </p>\n\n    <h5 id=\"the-preface-is-the-top-of-the-pyramid\">\n      The preface is the top of the pyramid.\n    </h5>\n\n  <p>\n    We should have a good idea of the preface before writing the text.\nThe preface is the beginning of an article and the top of the pyramid structure.\nA good preface allows readers to quickly understand what the article is going to discuss.\nThe purpose of the preface is to explain the background clearly, which leads to the central idea.\n  </p>\n\n  <p>\n    The preface is the prelude to an article, giving an account of the causes and consequences of the matter, that is, an introduction to the background.\nThen the introduction of conflict, we can understand the background as the introduction of the status quo and goals, and conflict is the gap between the status quo and goals.\nWhen a conflict occurs, readers generally ask questions about it, such as \"so what now?\"\n\"if you already have a ready-made solution, then give the reader solution.\nThe text of the article is to discuss the solution, \"Why do you do this\" and \"what should be done\".\n  </p>\n\n    <h5 id=\"the-background-is-to-tell-stories\">\n      The background is to tell stories.\n    </h5>\n\n  <p>\n    The preface usually starts with the background, and the best way to explain the background is to tell a story.\nThe story is generally easy to understand and does not need the reader to think. At the same time, it can make the reader recall his own experience and become interested in the article.\nThe story should revolve around the theme, and at the same time, it should be true and credible, so as to prevent readers from asking questions that are different from the main ideas in the preface.\nJoin me to write an article on \"how to import iPhone photos into Mac\". In the preface, readers should avoid asking questions such as \"Why should iPhone be used?\"\n  </p>\n\n    <h5 id=\"conflict-is-about-asking-questionsbr\">\n      Conflict is about asking questions<br>\n    </h5>\n\n  <p>\n    After explaining the background clearly, it will lead to conflict.\nConflict is the gap between reality and ideal, and the purpose of conflict is to make readers ask questions.\nSome articles also introduce conflicts in front of the background, which usually does not have a good solution in order to highlight the author's concerns.\nAs in the order of building a pyramid, the questions raised by the reader, if they already have an answer, should also be included in the preface.\n  </p>\n\n    <h5 id=\"the-text-is-the-main-body-of-the-pyramid\">\n      The text is the main body of the pyramid\n    </h5>\n\n  <p>\n    After reading the preface, the reader will ask a series of questions about the questions and solutions in the preface.\nUsually these questions focus on \"what is\", \"why\" and \"how to do it\". These questions are to be answered in the text.\n  </p>\n\n  <p>\n    It is common to use multi-level headings to present the pyramid structure in the text.\n<br>The title should not only show the structure of the article, but more importantly, let the reader have some expectations for the next content.\nSo the title usually uses simple and clear language to summarize the points to be discussed next.\nFor example, in this article, the title of \"Why to use the Pyramid principle\" is \"the Pyramid principle makes the article easier to understand\", which directly presents the reason, so that the reader can be prepared for the next content.\n  </p>\n\n  <p>\n    This is the pyramid structure used in writing this article, using multi-level headings to show what the pyramid principle is, \"why\" and \"how to do it\". The revised title also shows the reader the point of view discussed later. the low-level title answers the questions that the reader may ask when reading the upper content.\n  </p>\n\n    <h5 id=\"let-the-reader-take-action-at-the-endbr\">\n      Let the reader take action at the end<br>\n    </h5>\n\n  <p>\n    In theory, an article with a pyramid structure doesn't need to end, but it may make the reader feel a little sudden about the sudden ending. The ending should make readers feel a need and desire to take action. We should give the reader hints as to what he should think about and what he can do after reading the article and gaining new knowledge. <br>\n  </p>",
            "author": {
                "name": "one"
            },
            "tags": [
                   "Writing",
                   "Study"
            ],
            "date_published": "2021-04-30T16:54:10+08:00",
            "date_modified": "2021-04-30T16:54:31+08:00"
        },
        {
            "id": "https://notelism.com/about-reading/",
            "url": "https://notelism.com/about-reading/",
            "title": "About Reading",
            "summary": " Last year, I read very little, it is really a shame. But the reason for the lack of reading, one is too busy while two is gradually finding the \"not reading\" benefits.. In fact, during the “No reading”year, I thought more about reading.. You’d&hellip;",
            "content_html": "\n  <p>\n    Last year, I read very little, it is really a shame. But the reason for the lack of reading, one is too busy while two is gradually finding the \"not reading\" benefits.. In fact, during the “No reading”year, I thought more about reading..\n  </p>\n\n  <p>\n    \n  </p>\n\n    <h2 id=\"should-i-read-a-book\">\n      Should I read a book?\n    </h2>\n\n  <p>\n    You’d think the answer to that question would be “Yes,” but the truth is, I don’t have enough reason to convince you to read. Personally, the “Should” question doesn’t exist, but if I answer it intellectually, the answer is still -- yes.&nbsp;\n  </p>\n\n  <p>\n    Here’s why:\n  </p>\n\n    <h5 id=\"1reading-is-the-best-way-for-an-individual-to-acquire-knowledge\">\n      1)Reading is the best way for an individual to acquire knowledge\n    </h5>\n\n  <p>\n    A good book, especially an introduction to a certain field, covers most of the classic contents of a certain discipline system. It is precisely because classic, comprehensive, introduction books are the only way for a person to enter a certain discipline, and the construction of this system can not be replaced by film and television materials or other channels, which is called \"the best way\".\n  </p>\n\n    <h5 id=\"2reading-is-the-most-economical-way-for-individuals-to-acquire-knowledge\">\n      2)Reading is the most economical way for individuals to acquire knowledge.\n    </h5>\n\n  <p>\n    In terms of price, if a book does not pursue binding design and pay attention to the content alone, the price is really not very expensive. A dozen cheap books, some slightly more expensive books, and even some slightly luxurious books can be said to be \"economical\" in exchange for \"knowledge\" at such a price.\n  </p>\n\n    <h5 id=\"3reading-is-the-fastest-way-for-an-individual-to-acquire-knowledge\">\n      3)Reading is the fastest way for an individual to acquire knowledge.\n    </h5>\n\n  <p>\n    This can be seen from the comparison between reading and other ways. When a person wants to understand a certain field of knowledge, if he relies on listening to books and watching movies, he must spend no less time than it takes to finish reading a book. This can also be said to be \"the economy of time\". In addition, the human brain is willing to accept colorful and dynamic stimuli, but it is not easy to accept the single stimulus of words. Therefore, if the content in a certain field is presented by image or film and television, it may be easier to accept, but it can only leave a superficial impression, but at first it takes more time to digest, while books are not. because the text itself is \"monotonous and boring\", the digestion of the content is accompanied by the whole process of reading, and the impression you get after reading a book must not be limited to one line of words and one sentence, but the whole content is understood.<br>The <mark><strong>three reasons</strong></mark> I give are \"personal\" and clearly point out the benefits of \"acquiring knowledge\".\nSo, if you need to acquire knowledge in a certain field, then don't hesitate, you should read.\n  </p>\n\n  <p>\n    But at the same time, it must be pointed out that in my opinion, although reading is a \"should\" thing to do, reading is also a dangerous activity.\nTherefore, the person who indiscriminately recommends everyone to read all books, even if he is a scholar, must be doubtful.\nYou know, the nourishment of a good book may last a lifetime, while a bad book may be poisonous for a lifetime.\nOf course, the views on good books and bad books vary from time to time, which involves a certain value judgment, which will not be discussed in detail here.\nBut in the situation of \"the whole people do not read\", what is more important than the question of \"good books and bad books\" is, which book is the most suitable for you?\n  </p>\n\n  <p>\n    In short, if you want to acquire knowledge in a certain field, read!\n  </p>\n\n    <h2 id=\"is-it-necessary-to-read\">\n      Is it necessary to read?\n    </h2>\n\n  <p>\n    <mark>In my opinion, reading is something that \"should be done\" but \"not necessary\" for everyone to do.&nbsp;</mark>Even if a thing should be done, you may not have to do it. On the other hand, even if a thing should not be done, you may not necessarily not do it.\n<br>For example: according to the ethics of public places, each of us should give up our seat to the weak on the bus, but we may not do so. Conversely, no one should run a red light, but you will occasionally run it under certain circumstances.\n<br>It's the same with reading.\n  </p>\n\n  <p>\n    The unnecessary reason is simple:\n  </p>\n\n  <p>\n    <strong><em>1)Everyone has limited time and can only do the most important things.\n</em></strong><br>If reading does not keep you alive and will take up a lot of your time, then it is more reasonable to spend your time on \"survival\".&nbsp;\n  </p>\n\n  <p>\n    <strong><em>2)Reading is not the only way to acquire knowledge.\n</em></strong><br>It may be the best, most economical and most convenient way to acquire knowledge (this is just my opinion), but it is not irreplaceable and certainly suitable for you.\nThe era we live in is called the \"<mark>digital age</mark>\". There are not only words, but also speeches, podcasts, videos, VR, AR and so on.\nCompared with words, pictorial knowledge is also easier for us to accept, more vivid and interesting, so is there any reason why they can't replace \"reading\"?\nIn addition, every kind of knowledge must have its most suitable way to acquire, reading is only one of these ways, in most cases is not the most suitable one.\n  </p>\n\n  <p>\n    <strong><em>3)Reading is not the only way to get the best emotional experience.\n</em></strong><br>One of my propositions is that if reading doesn't give people a good emotional experience, it's better not to read at all.\nOf course, the \"happiness\" I'm talking about here is only one of the emotional experiences, and the reading process may be accompanied by pain, satisfaction, boredom, anger and other emotions.\nSo how do you define this \"good emotional experience\"?\n<br>Are pain and anger \"good\"?\nMaybe we should take into account what we think of as negative emotions.\nGenerally speaking, in the process of reading the novel, the reader's emotional experience will be very obvious, especially the type of novel whose plot is particularly attractive (martial arts, science fiction, romance, etc.). This kind of emotional fluctuation is normal in the process of reading. and the novel itself has the function of emotional catharsis, so is part of the purpose of the author's own creation.\nBut in this era, \"fast food culture\" often gives people a greater impact, so that people get emotional experience in a variety of ways, \"fast-paced\" way of life brings people a fast-paced emotional experience.\nFor example, we can temporarily get rid of the world and immerse ourselves in the ups and downs of the movie, and then pull it out, while reading is a kind of \"slow work\", which takes more time, obviously unable to meet people's \"fast\" needs.\n  </p>\n\n  <p>\n    Saying that \"reading is something that should be done but does not need everyone to do\" does not mean that I do not advocate reading. Reading is irreplaceable in obtaining a longer-term emotional experience, sharpening the mind and exercising the mind.\n<br>I still remember the pleasure of immersing myself in the the pleasure of reading martial arts novels all night. I also remember the scene when I was fascinated by the video games when I was a child, but now people may be more impressed by video games. As far as emotions are concerned, there may be no difference, but in terms of ability improvement, it can only be said that \"each has his own strengths\".\n<br>A good game is better than a good book, but it can't completely replace the good book (on the contrary), because the game is loose and real-time, and the book is tight and permanent.\n<br>On the contrary, some games can help people improve their spatial cognitive ability, and most books can't do that.\nThis is also one of the reasons why reading is \"unnecessary\".\n  </p>\n\n    <h2 id=\"how-to-read-a-book\">\n      How to read a book?\n    </h2>\n\n  <p>\n    The experience of our predecessors may be useful for reference, but it is not a day to develop reading habits and methods. Moreover, the books read by the ancients are different from those we read now, and there is no need to blindly copy them.\n<br>Therefore, my opinion is that different methods should be used to read different types of books, and the method of reading should change with the purpose of reading.\n<br>For example, reading social science and reading novels should adopt different reading methods, reading social science, focusing on acquiring new knowledge, so we need to take steps to capture the ideas and logic in the article, while reading novels, focusing on reading experience, should be as fast as the wind, immersed in it, aftertaste, aftertaste, aftertaste.\n<br>In addition, although they are both reading novels, the reading methods of ordinary readers are certainly different from those of professional researchers. as mentioned earlier, ordinary readers do not pursue an in-depth analysis of the structure and thought of the novel, while the researchers are not. in the understanding of the novel as a whole, we should also \"divide the novel into pieces\" and carefully examine the details such as the logic of the development of the story and the shaping of characters.\n<br>This is my personal experience, that is, you don't have to stick to the same method in reading.\n  </p>",
            "image": "https://notelism.com/media/posts/6/aliis-sinisalu-yzVxz_OYVxU-unsplash.jpg",
            "author": {
                "name": "one"
            },
            "tags": [
                   "Study",
                   "Reading"
            ],
            "date_published": "2021-04-30T10:18:28+08:00",
            "date_modified": "2021-04-30T11:30:33+08:00"
        },
        {
            "id": "https://notelism.com/suggestions-in-writing/",
            "url": "https://notelism.com/suggestions-in-writing/",
            "title": "Suggestions in writing",
            "summary": "1. Continuously maintain high quality input I recall that when I first wrote, I sat in front of the computer, scratching my ear and scratching my cheek, and I didn't know how to write. In the final analysis, my stomach had too little \"ink\" to&hellip;",
            "content_html": "<h2>1. Continuously maintain high quality input</h2>\n<p>I recall that when I first wrote, I sat in front of the computer, scratching my ear and scratching my cheek, and I didn't know how to write. In the final analysis, my stomach had too little \"ink\" to hold the literati. Less \"ink\" means we don't have enough input. <br>Input is like the inlet of a reservoir. Only by keeping a continuous supply of input can there be a continuous flow of output. Input and output is a complete closed loop. <br><span style=\"text-decoration: underline; color: #3598db;\"><em>So what are inputs and outputs? </em></span><br>What you hear, what you learn, what you see can be called input, and what you write and say can be called output. We usually read books, read articles is a kind of input, communicate with people, get new ideas and methods, these are also a kind of input. <br>Even what you see and hear during the journey, the new things you come into contact with, is also a kind of input. <br>For example, when I read books and read other people's articles, I will encounter some golden sentences, stories and cases; chat with friends, classmates and strangers, talk about good methods, new ideas, and desirable places. I will write down, accumulate more, collect more, organize more, absorb more, and internalize more. <br>In writing, when you encounter the right topic, you can sort it out and use it, which can not only make the content of the article appear lively and interesting, but also enrich the content, so that the whole article will not be full of our own stories, so that it will be written out in less than a few times. <br>For good methods, I will also practice and experience more deeply. This is a typical use of input and output. Only by insisting on self-knowledge input and integrating into one's own practice can we make these common principles more attractive and more persuasive when they are passed on to everyone. Readers are also more willing to accept, resonate, make changes, and take action.</p>\n<h2>2.Writing should think carefully, improve the depth and highlight the novelty</h2>\n<p>Writing is the process of expressing ideas in words, and the words you write are the crystallization of your thinking. If your brain is empty, no matter how good your writing skills are, you can only moan without illness. The point you think out is the soul of the article. The clearer you think, the clearer you can write. A profound article comes from deep thinking. <br>There are many writers now, and when you think of a point, many Daniel writers may have written it already. No matter how good you are, it is very difficult to stand out, because when readers go to see the big names, your reading volume and attention will naturally be less. <br>When writing, you can first go to the platform or the web to search for similar topics or articles, if there is already a particularly good one, then continue to think about the theme to avoid bumping into shirts and homogenizing content. <br>Want to scarce themes or ideas and perspectives are relatively \"new\". <br>There are two methods that can be used. <br><em><strong>1) the exclusion method of three-tier thinking. </strong></em><br>Is to face a subject, the first layer of thinking to think of a theme, and then think of the second, and then think hard back, until come up with a new point of view. <br><strong><em>2) the method of multi-angle observation of the same subject matter. </em></strong><br>Try to analyze it from different angles, for example, excellent movies will have a lot of reviews, and everyone will cut into different angles, and the effect will be different. These are all materials for us to learn. <br>Then how to improve their thinking ability, introduce several methods, are very easy to use. <br><em><strong>1) when you encounter anything, ask yourself a few more \"why\".</strong></em></p>\n<p>When you were a child, when you encounter something, we always like to ask a lot of why. Later, we all grew up, a lot of things, our thinking is only on the surface, no longer want to ask why, gradually, we are too lazy to think. <br>For a writer, we should constantly ask ourselves \"why\", dig deeper, explore the truth, pursue the deepest thoughts, force ourselves to think, and pursue the origin of things. <br><strong><em>2) A4 paper brainstorming</em></strong><br>Take a minute to write down your thoughts on A4 paper. <br>Write down the topic you want to express on each piece of paper, write 4-6 lines on a page, 20-30 words on each line, and limit the time to one minute. <br>The way to do this is to quickly focus your attention and arouse your thoughts. <br>Long-term training can easily improve the ability of deep thinking. <br><strong><em>3) use the golden circle of thinking. </em></strong><br>The way we look at problems is divided into three levels. <br><strong>The first level</strong> is the what level, that is, the appearance of things, everything we do. <br><strong>The second level </strong>is the how level, that is, how we achieve what we want to do. <br><strong>The third level </strong>is the why level, which is why we do such things. <br>The most basic application of the golden circle of thinking is: when you encounter everything, you must first ask \"why\" in order to know what to do and what to do. For example, when you write, you must first think about \"why you want to write\". Only by thinking clearly about why can you have the motivation to continue to write. <br>We should develop the habit of asking why when solving problems, and do things from the beginning to the end. If you slowly develop this habit of thinking, you will grow and gain from anything, and the effect of this ability is the most frightening and amazing.</p>\n<h2>3.Continuously improve writing skills.</h2>\n<p>Writing is also a skill, it takes deliberate practice to make perfect, every writing is an exercise, every time reading other people's articles, dismantling the writing methods of other people's articles, is a kind of learning. <br>Novices usually not only have to study other people's excellent works, imitate and learn; on the other hand, they should start to write boldly. Only when they really write, can they have a chance to write better and better; they can also specialize in reading books to improve their writing skills in an all-round way. <br><span style=\"color: #3598db;\"><strong>Write more and change more. </strong></span><br>If you write less, your brain will not live; if you change less, you will not be able to express clearly. You can also read relevant writing books about improving your writing skills. I recommend that I have read several books that have a great influence on me.</p>",
            "author": {
                "name": "one"
            },
            "tags": [
                   "Writing"
            ],
            "date_published": "2021-04-29T18:15:29+08:00",
            "date_modified": "2021-04-29T18:21:11+08:00"
        },
        {
            "id": "https://notelism.com/get-rid-of-the-following-five-misunderstandings-and-you-will-make-progress-faster/",
            "url": "https://notelism.com/get-rid-of-the-following-five-misunderstandings-and-you-will-make-progress-faster/",
            "title": "Get rid of the following five misunderstandings, and you will make progress faster",
            "summary": " Indulge in things that are \"easy to get a high sense of achievement\" Consciously or unintentionally seek a recipe for a great \"return\" with a small amount of effort, even if the reward is virtual. This kind of behavior will raise their own \"excitement&hellip;",
            "content_html": "\n    <h2 id=\"indulge-in-things-that-are-easy-to-get-a-high-sense-of-achievement\">\n      Indulge in things that are \"easy to get a high sense of achievement\"\n    </h2>\n\n  <p>\n    Consciously or unintentionally seek a recipe for a great \"return\" with a small amount of effort, even if the reward is virtual. This kind of behavior will raise their own \"excitement threshold\", making people less and less likely to have a sense of achievement, thus relying more and more on a virtual sense of achievement and falling into a vicious circle.&nbsp;\n  </p>\n\n  <p>\n    Mild symptoms:&nbsp;\"addicted to games\" (speeding up the passage of time in the virtual world, so that \"success\" comes faster), \"stallion novels\" (obscene people can easily get what they want);\n  </p>\n\n  <p>\n    Serious symptoms and even illegal: gambling\" (easy access to \"money\"), \"drug abuse\" (easy to get the feeling of \"cool\"), and so on.\n  </p>\n\n    <h2 id=\"only-receive-sources-with-low-information-densitynbsp\">\n      Only receive sources with \"low information density\"&nbsp;\n    </h2>\n\n  <p>\n    Only willing to receive information with low information density (such as videos and pictures that do not need too much brainstorming, as well as shallow entertainment, gossip, sports news, etc.). Do not want to receive information with high information density and can only be absorbed after careful consideration (such as courses, knowledge frameworks, analytical reports, etc.).&nbsp;\n  </p>\n\n  <p>\n    Since most of the really valuable and progressive information needs to be considered and digested, it will not be possible to make progress without in-depth study and understanding.\n  </p>\n\n    <h2 id=\"get-used-to-paralyzing-yourself-with-a-sense-of-misplaced-achievement\">\n      Get used to paralyzing yourself with a sense of \"misplaced achievement\"\n    </h2>\n\n  <p>\n    <br>There are two categories: first, compare your strengths with other people's weaknesses, so as to get the illusion of \"better than others\" (for example, compared with athletes, and high achiever compared with sports); second, when others are resting after serious work, pretend to work harder (for example, \"show off\" that you have done more work than others on holidays, but only on holidays).\n  </p>\n\n    <h2 id=\"overreliance-on-existing-feasible-paths\">\n      Over-reliance on \"existing feasible paths\"\n    </h2>\n\n  <p>\n    At work, after getting used to the process of a thing, I never think about how to improve it. I will only repeat it mechanically, and then deceive myself to be full. If there is no improvement, there is no consciousness of getting rid of dross, so there are more and more things that need to be repeated and take longer and longer. in the end, it seems that a lot of things have been done every day, but in fact, there is not only no progress at all. the time of progress that should have been made is also wasted.\n  </p>\n\n    <h2 id=\"close-the-channel-of-reinforcement-learning\">\n      Close the channel of \"reinforcement learning\"\n    </h2>\n\n  <p>\n    In learning or receiving information, you are only willing to perform the simplest first step, but are unwilling to carry out the next more complex consolidation and application process, only listening without speaking, reading without writing, learning without practice, and paralyzing yourself by saying that you have learned a lot. In fact, this kind of \"shallow\" learning forgets so quickly that sometimes it is better not to learn at all. For example, learn English every day, but never write English articles.\n  </p>",
            "author": {
                "name": "one"
            },
            "tags": [
                   "Progress"
            ],
            "date_published": "2021-04-29T17:41:02+08:00",
            "date_modified": "2021-04-29T17:41:37+08:00"
        },
        {
            "id": "https://notelism.com/how-to-learn-faster/",
            "url": "https://notelism.com/how-to-learn-faster/",
            "title": "How to learn faster?",
            "summary": "There are two modes of the human brain The two modes are the most efficient to use alternately. If you knock yourself to death in any mode, you are doing useless work. Focused mode: your brain is mainly learning, entering information, and doing information matching&hellip;",
            "content_html": "<h2><span class=\"text-dst\">There are two modes of the human brain</span></h2>\n<address><strong><span class=\"text-dst\">The two modes are the most efficient to use alternately. If you knock yourself to death in any mode, you are doing useless work.</span></strong></address>\n<p><span class=\"text-dst\"><strong>Focused mode</strong>: your brain is mainly learning, entering information, and doing information matching work. </span><span class=\"text-dst\">It is usually started when we are working and studying.</span><br><span class=\"text-dst\"><strong>Diffuse mode</strong>: your brain is doing internal analysis, generating new links, re-linking and kneading old knowledge. </span><span class=\"text-dst\">This state is initiated when we sleep, exercise and other relaxed states. </span><span class=\"text-dst\">Sometimes you have inspiration when you take a shower, and that's what this pattern does.</span></p>\n<p><span class=\"text-dst\"> To sum up, it is necessary to stop and play after studying for a period of time. </span><span class=\"text-dst\">It's not laziness, but only in this way, your brain works most efficiently.</span></p>\n<h2>Procrastination is normal</h2>\n<p><span class=\"text-dst\">According to scientists, when we encounter something we don't like or something very difficult, the brain secretes a special substance that makes you feel uncomfortable. </span><span class=\"text-dst\">Then it naturally encourages you to focus on other things, and you procrastinate. </span></p>\n<p><span class=\"text-dst\">So, first of all, you have to know that procrastination is a normal human behavior, so don't blame yourself too much. </span></p>\n<p><span class=\"text-dst\">What are we going to do with it? </span><span class=\"text-dst\">Our brains also have a magical function, that is, once you focus on a task for more than five minutes, this particular substance will stop secreting. </span><span class=\"text-dst\">So the solution to doing unhappy things is to force yourself to start for five minutes, and then everything will be fine.</span></p>\n<h2><span class=\"text-dst\">About memory. </span></h2>\n<address><strong><span class=\"text-dst\">The content needs to be repeated constantly, and the higher the previous repetition frequency, the longer the memory will be preserved</span></strong></address>\n<p><span class=\"text-dst\">Which of the following ways can achieve a better and faster memory effect if you want to remember a poem?</span><br><span class=\"text-dst\"><strong>A</strong> memorize over 20 times a day.</span><br><span class=\"text-dst\"><strong>B</strong> recite 10 times on the first day, 5 times on the second day, and 5 times on the 4th day.</span><br><span class=\"text-dst\">The answer is <strong>B. </strong></span><span class=\"text-dst\">Because memory is divided into <strong>short-term memory</strong> and<strong> long-term memory</strong>, the way to convert short-term memory into long-term memory is to repeat over a period of time, rather than one at a time.</span></p>\n<h2 class=\"textpanel-source active\"><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit;\">Sleep is a magic weapon that can make you smarter</span></h2>\n<p><span class=\"text-dst\">What are our brains doing while we sleep?</span><br><span class=\"text-dst\">1. Clean up the garbage secretions produced by heavy exercise during the day.</span><br><span class=\"text-dst\">2. Reorganize the information entered during the day, classify them and re-link them. </span><span class=\"text-dst\">Suppose the brain is a large cabinet with many drawers, and the large amount of information entered during the day is like all kinds of things that have just been bought. </span><span class=\"text-dst\">After going to bed at night, the brain classifies these things into various drawers one by one, so that you can use them later.</span><br><span class=\"text-dst\">3. Strengthen the link between new knowledge and old knowledge, and subconsciously keep thinking about the problems that have not been solved during the day. </span><span class=\"text-dst\">The most important thing is that these movements can only be done during sleep, so sleep is really an important task.</span></p>\n<h2><span class=\"text-dst\">To build a strong framework, you need two things, Chunking and Connecting</span></h2>\n<p><span class=\"text-dst\"><strong>Chunking</strong>, the knowledge we take in every day, like building bricks in a house, is independent. </span><span class=\"text-dst\">If you want to build a house, you must have enough bricks, so it is necessary to learn all kinds of information.</span><span class=\"text-dst\"> To build a house, you also need cement to connect these bricks. </span><span class=\"text-dst\">This requires that every time you learn a knowledge, you should think about the causes and consequences of this knowledge, what are the rules, and so on.</span><br><span class=\"text-dst\"><strong>Connecting</strong>, you will have the ability to innovate. </span><span class=\"text-dst\">Because you can find a pattern in the connection of each small module. </span><span class=\"text-dst\">Then as you have more and more connections and become more and more powerful, there will be more possibilities for connections. </span><span class=\"text-dst\">The ability to innovate is coming.</span></p>\n<h2><span class=\"text-dst hl\">What to do when you need to learn something difficult</span></h2>\n<p><span class=\"text-dst\">First, if you need to learn something that is difficult,, don't focus on the results, enjoy the process. </span><span class=\"text-dst\">Paying too much attention to the result will make you give up.</span><br><span class=\"text-dst\">The second is to give yourself periodic rewards, which is very important. </span><span class=\"text-dst\">Proper self-discipline is freedom, and excessive self-discipline is self-harm. </span><span class=\"text-dst\">Your respect for human nature, respect for the nature of your brain, and a reward from time to time will make it easier for you to stick to it. </span><span class=\"text-dst\">The interval between rewards should not be too long. </span><span class=\"text-dst\">For example, if you lose weight for 5 days, you can eat freely; after 2 hours of homework, you can play with your cell phone for 10 minutes. After this reward, you are full of energy.</span><br><span class=\"text-dst\">Third, believe in yourself and don't blame yourself all the time. </span><span class=\"text-dst\">As long as this time is a little better than last time, it will be all right. </span><span class=\"text-dst\">Of course, if it's not good once in a while, it doesn't matter, it's better next time.</span></p>",
            "author": {
                "name": "one"
            },
            "tags": [
                   "Study"
            ],
            "date_published": "2021-04-29T10:56:39+08:00",
            "date_modified": "2021-04-29T11:22:35+08:00"
        }
    ]
}
